In [2]:
import pandas as pd
import numpy as np

In [3]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}
table_one = pd.DataFrame(data_one)
table_two = pd.DataFrame(data_two)

In [4]:
display(table_one)
display(table_two)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [5]:
pd.concat([table_one, table_two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
pd.concat([table_one, table_two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [7]:
table_two.columns = table_one.columns

In [8]:
concat01 = pd.concat([table_one, table_two])
concat01

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [9]:
# Reset index
concat01.index = range(len(concat01))

In [10]:
concat01

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

Merge

In [11]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

Inner Join

In [12]:
pd.merge(
    registrations,
    logins,
    how="inner",
    on="name"
)

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [14]:
pd.merge(
    registrations,
    logins,
    how="left"
)

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [15]:
pd.merge(
    registrations,
    logins,
    how="left",
    on="name"
)

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN